{
  "Personagens": [
    {"id": 1, "nome": "Ted Mosby", "img":"https://static.wikia.nocookie.net/himym/images/1/14/WB0rq.jpg/revision/latest/scale-to-width-down/210?cb=20130113174836", "descrição": "Em 2030, Ted sentou-se para contar aos filhos a história de “How I Met Your Mother”. Começando em 2005, a jornada sinuosa de Ted o levou por muitos relacionamentos fracassados, inclusive sendo deixado no altar. Mas o arquiteto que virou professor não desiste de sua busca pelo Único. Ela está por aí, e cada episódio da vida de Ted o deixa um passo mais perto de conhecê-la."},
    {"id": 2, "nome": "Marshal Eriksen", "img":"https://static.wikia.nocookie.net/himym/images/5/50/PlcCt.jpg/revision/latest/scale-to-width-down/210?cb=20130113174817",  "descrição":"Em 1996, ele e Ted Mosby se conheceram na Wesleyan University ainda na graduação e são melhores amigos desde então. Atualmente, ele é casado com Lily Aldrin, também ex-aluna Wesleyana. Criado na comunidade unida de St. Cloud, Minnesota, a bondade inerente de Marshall faz dele o membro mais compassivo da gangue. Ele largou o emprego como advogado corporativo no Goliath National Bank para perseguir seu sonho de salvar o mundo por meio da legislação ambiental. Em Desafio aceito, Lily engravidou e deu à luz seu filho, Marvin W. Eriksen, em O Código do Mágico - Parte Um. Em Daisy​​​, Lily engravidou novamente e deu à luz sua filha, Daisy Eriksen, em fevereiro de 2014. Em flashforwards para 2016, é revelado que Lily está grávida de seu terceiro filho e em 2020, ele anuncia que está concorrendo a um assento na Suprema Corte do Estado de Nova York."},
    {"id": 3, "nome": "Barney Stinson", "img":"https://static.wikia.nocookie.net/himym/images/8/83/Rc0JG.jpg/revision/latest/scale-to-width-down/210?cb=20130113174854",  "descrição":"Ele conheceu Ted Mosby no MacLaren's Pub em 2001 e depois se iniciou como parte da gangue, imaginando-se o melhor amigo de Ted, apesar dos protestos de Ted. Depois de ser queimado aos vinte e poucos anos por uma namorada que o trocou por um empresário, Barney se reinventa com um terno e um mulherengo em série, que rejeita ferozmente qualquer forma de compromisso. Ele realiza elaborados atos de sedução e regularmente pratica sexo casual. À medida que a série avança, Barney revela ter problemas de infância não resolvidos, especificamente com seu pai ausente, com quem ele se reconecta em 2011. A vida de devassidão de Barney se desgasta à medida que ele amadurece e experimenta vários relacionamentos sérios, em particular seu relacionamento intermitente com Robin. Suas elaboradas técnicas de sedução são uma fonte constante de humor (normalmente para Marshall), espanto (normalmente para Ted) e repulsa (normalmente para Lily) para o grupo. Embora a maioria de suas peças de sedução sejam frias e mesquinhas, ele é extremamente atencioso com amigos e familiares, muitas vezes usando sua riqueza para ajudá-los a sair de situações difíceis. Ele é um ator importante para ajudar Marshall e Ted a encontrar empregos bem remunerados no GNB e ajuda Robin a permanecer nos Estados Unidos quando seu visto é quase cancelado. A partir de Last Forever, Barney e Robin se divorciaram após três anos de casamento (2013 - 2016), sendo incapazes de manter o relacionamento enquanto a carreira de Robin se tornava global. Em setembro de 2019, Barney descobre que será pai, após um caso de uma noite. Ele fala sobre como criar sua filha com alegria quando comparece ao casamento de Ted e Tracy em 2020."},
    {"id": 4, "nome": "Lily Aldrin", "img":"https://static.wikia.nocookie.net/himym/images/c/cb/JJVSY.jpg/revision/latest/scale-to-width-down/210?cb=20130113174828",  "descrição":"Ela é esposa de Marshall Eriksen e melhor amiga de Robin Scherbatsky, além de uma das amigas mais próximas de Ted Mosby, conhecendo ele e Marshall desde a faculdade. Atualmente trabalha como consultora de arte do Capitão, tendo sido professora de jardim de infância. Ela também é pintora amadora. Ela é virtualmente incapaz de guardar segredos, com algumas exceções. Em Desafio Aceito, Lily está grávida e em O Código do Mágico - Parte Um ela dá à luz um menino chamado Marvin. Durante o fim de semana do casamento de Barney e Robin, é revelado que Lily engravidou novamente. Em fevereiro de 2014 ela dá à luz a filha Daisy Eriksen, onde também é mostrado que Lily e Marshall passam o ano em Roma. No final Last Forever, num flashforward de 2016, Lily anuncia que está grávida do terceiro filho."},
    {"id": 5, "nome": "Robin Scherbatsky", "img":"https://static.wikia.nocookie.net/himym/images/9/97/O5wDi.jpg/revision/latest/scale-to-width-down/210?cb=20191024051604",  "descrição":"Her dad is Robin Scherbatsky Sr., and she has a younger sister, named Katie. She is a Scotch-drinking, cigar-smoking, gun-toting Canadian pop-star-turned-journalist-turned-morning-show-host. In the finale, it is shown that by 2020 she had risen to stardom at World Wide News as their foreign correspondent, but recently decided to take a news anchor position and settle down in New York again. Robin befriended the gang in 2005 after an awkward date with Ted Mosby. She is Lily's best friend and Ted's ex-roommate and ex-girlfriend. In 2013, she marries Barney, but they get divorced in 2016. In 2030, six years after Ted's wife dies, he shows up to her apartment with a blue French horn, and the show ends with her smiling down at him from her window. "}
  ]
}
